# 17: Resampling pada data deret waktu (time series data)

"Enjelita Meilinda - 2373037"
# Import Modules

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

# Persiapan Data Frame

In [3]:
n_rows = 365 * 24 
n_cols = 2         
cols = ['col1', 'col2'] 

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df.index = pd.date_range(start='2023-01-01', periods=n_rows, freq='h')

df.head()

                     col1  col2
2023-01-01 00:00:00    12     5
2023-01-01 01:00:00     3     4
2023-01-01 02:00:00     2    18
2023-01-01 03:00:00    12     2
2023-01-01 04:00:00    15    12

# Resampling data dengan interval monthly

In [4]:
df.resample('M')['col1'].sum().to_frame()

            col1
2023-01-31  7396
2023-02-28  6774
2023-03-31  7487
2023-04-30  7233
2023-05-31  7355
2023-06-30  7011
2023-07-31  7573
2023-08-31  7422
2023-09-30  7126
2023-10-31  7505
2023-11-30  7481
2023-12-31  7615

# Resampling data dengan interval daily

In [5]:
df.resample('D')['col1'].sum().to_frame()

            col1
2023-01-01   185
2023-01-02   236
2023-01-03   261
2023-01-04   225
2023-01-05   223
...          ...
2023-12-27   245
2023-12-28   242
2023-12-29   217
2023-12-30   214
2023-12-31   233

[365 rows x 1 columns]